tsung/LoadTestAsWhole.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="HotPot-Shu.nppuqyf9yy.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="120" unit="second">
      <users arrivalrate="5" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="3" duration="120" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="4" duration="10" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="5" duration="120" unit="second">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>

    <!-- 

    <arrivalphase phase="4" duration="20" unit="second">
      <users arrivalrate="70" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="5" duration="20" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="6" duration="20" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="7" duration="20" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="8" duration="20" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="9" duration="20" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    -->
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>

    <!-- Loadtest for writer -->
    <session name="writer" probability="5" type="ts_http">

      <!-- User login -->

      <request subst="true">
        <!-- Here the url for login should be "/sessions", instead of "/login"  -->
        <http url="/sessions" method="POST" version="1.1" contents="session[email]=boyuan@ucsb.com&amp;session[password]=123456&amp;commit=Login" content_type="application/x-www-form-urlencoded" />
      </request>


      <!-- User post question -->
      <request subst="true">
        <http url="/questions" method="POST" version="1.1" contents="question[title]=QuestionTitle&amp;question[content]=QuestionContent&amp;commit=Post"
content_type="application/x-www-form-urlencoded" />
      </request>
      
      <!-- User create answer -->
      <request subst="true">
        <http url="/questions/4089/articles" method="POST" version="1.1" contents="article[text]=6666666666666&amp;commit=CreateArticle&amp;question_id=1"
content_type="application/x-www-form-urlencoded" />
      </request>
      



      <!-- User logout -->
      <request subst="true">
        <http url="/signout" method="POST" version="1.1" contents="_method=delete" content_type="application/x-www-form-urlencoded"/>
      </request>
    </session>


    <!-- Load test bewteen writer and reader -->
    <session name="http-example" probability="10" type="ts_http">
      <request>
        <http url='/sessions' version='1.1' method='POST' contents="session[email]=boyuan@ucsb.com&amp;session[password]=123456&amp;commit=Sign+in" content_type="application/x-www-form-urlencoded"></http>
      </request>

      <request>
        <http url="/users" method="GET" version="1.1"/>
      </request>

      <request>
        <http url="/users?q[name_cont]=boyuan&amp;commit=Search" method="GET" version="1.1" />
      </request>

      <request>
        <http url="/relationships" method="POST" version="1.1" contents="relationship[followed_id]=2&amp;commit=Follow"/>
      </request>

      <request>
        <http url="/questions" method="GET" version="1.1"/>
      </request>

      <request>
        <http url="/questions" method="POST" version="1.1" contents="question[title]=why+so+many+people+choose+to+stay+single&amp;question[content]=People+are+getting+more+and+more+nowadays&amp;commit=Post"/>
      </request>

      <request>
        <http url="/questions/4093/articles" method="POST" version="1.1" contents="article[text]=i+want+to+answer&amp;commit=Create+Article" />
      </request>
      <request>
        <http url="/questions/4093/articles" method="POST" version="1.1" contents="article[text]=i+have+a+great+answer&amp;commit=Create+Article" />
      </request>

      <request>
        <http url="/articles/4089/comments" method="POST" version="1.1" contents="comment[body]=this+answer+is+really+great&amp;commit=Create+Comment" />
      </request>

      <request>
        <http url="/articles/4089/like" method="PUT" version="1.1" />
      </request>

      <request>
        <http url="/signout" method="POST" version="1.1" contents="_method=delete"/>
      </request>

    </session>

    <!-- Loadtest for Reader -->  
    <session name="Reader" probability="80" type="ts_http">

      <!-- User login -->

      <request subst="true">
        <!-- Here the url for login should be "/sessions", instead of "/login"  -->
        <http url="/sessions" method="POST" version="1.1" contents="session[email]=boyuan@ucsb.com&amp;session[password]=123456&amp;commit=Login" content_type="application/x-www-form-urlencoded" />
      </request>

      <!-- Read Questions and Answers. Repeat for 50 times.-->
      <request>
        <http url='/questions/4010' version='1.1' method='GET'></http>
      </request>

		<request>
        <http url="/users" method="GET" version="1.1"/>
      </request>

      <request>
        <http url='/questions/4020' version='1.1' method='GET'></http>
      </request>

		<request>
        <http url="/questions" method="GET" version="1.1"/>
      </request>


      <!-- User logout -->
      <request subst="true">
        <http url="/signout" method="POST" version="1.1" contents="_method=delete" content_type="application/x-www-form-urlencoded"/>
      </request>
    </session>

    
    <!-- Loadtest for Questions with tons of answers & comments (50 answers per question, 20 comments per answers)-->  
    
    <session name="ComplexQuestions" probability="5" type="ts_http">

      <!-- User login -->

      <request subst="true">
        <!-- Here the url for login should be "/sessions", instead of "/login"  -->
        <http url="/sessions" method="POST" version="1.1" contents="session[email]=boyuan@ucsb.com&amp;session[password]=123456&amp;commit=Login" content_type="application/x-www-form-urlencoded" />
      </request>

      <!-- Read Questions and Answers. Repeat for 50 times.-->
      <request>
        <http url='/questions/6005' version='1.1' method='GET'></http>
      </request>

      <!-- User logout -->
      <request subst="true">
        <http url="/signout" method="POST" version="1.1" contents="_method=delete" content_type="application/x-www-form-urlencoded"/>
      </request>
    </session>
  </sessions>
</tsung>