tsung/ReaderLoadTest.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="localhost" port="3000" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="1" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <!-- User login -->

      <request subst="true">
        <!-- Here the url for login should be "/sessions", instead of "/login"  -->
        <http url="/sessions" method="POST" version="1.1" contents="session[email]=12345@qq.com&amp;session[password]=123456&amp;commit=Login" content_type="application/x-www-form-urlencoded" />
      </request>

      <!-- Read Questions and Answers. Repeat for 50 times.-->
      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <request>
        <http url='/questions/4' version='1.1' method='GET'></http>
      </request>

      <!-- User logout -->
      <request subst="true">
        <http url="/signout" method="POST" version="1.1" contents="_method=delete" content_type="application/x-www-form-urlencoded"/>
      </request>

    </session>
  </sessions>
</tsung>